{
  "backend/main.mo": "Main Motoko actor for the Face Recognition Attendance System, implementing student profile management, attendance recording, user profiles, and role-based access control with admin bootstrap logic using storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (AdminRegister page, App.tsx routing update, and useQueries mutation hook) to their corresponding files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of all frontend source files, describing the purpose and recent changes of each component, page, hook, and style file.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app at the `#root` div and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing to render AdminRegister (`#admin-register`), AdminLogin/AdminDashboard (`#admin`), or the student attendance flow, with loading and authentication guards.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page card component shown to unauthenticated users, describing the app and providing an Internet Identity login button.",
  "frontend/src/components/admin/AttendanceHistory.tsx": "Admin component that displays a searchable, sortable table of all attendance records and provides a CSV export feature.",
  "frontend/src/components/admin/RegisterStudent.tsx": "Admin form for registering a new student with name, ID, and a face photo captured via webcam or file upload, uploading the image as an ExternalBlob to the backend.",
  "frontend/src/components/admin/StudentsManagement.tsx": "Admin component that lists all registered students in a searchable table with avatars, student IDs, and active status badges.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky application header showing the FaceAttend brand, authenticated user avatar with admin badge, a theme toggle, and login/logout controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name and creates their profile via the `useSaveCallerUserProfile` mutation, blocking interaction until submitted.",
  "frontend/src/components/student/AttendanceList.tsx": "Displays a scrollable, chronologically sorted list of a student's attendance records showing class ID, date, and time.",
  "frontend/src/components/student/FaceRecognitionScanner.tsx": "Student-facing component that activates the webcam, captures a photo, performs pixel-level similarity comparison against the stored face image, and records attendance if the similarity exceeds a threshold.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control if a token is present, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status via an AuthClient wrapper.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor calls including user profiles, student profiles, attendance records, and face recognition operations, with error extraction helpers.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with three tabs—Students, Register, and Attendance—rendering the corresponding management components for each section.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that authenticates via Internet Identity and redirects to the admin dashboard once the caller is confirmed as an admin.",
  "frontend/src/pages/AdminRegister.tsx": "Admin registration page that allows the first user to register as a system administrator via Internet Identity, then redirects to the admin dashboard on success.",
  "frontend/src/pages/StudentAttendance.tsx": "React page that allows students to mark attendance via face recognition scanner and view their attendance summary/history using data fetched from backend hooks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, border radius, animations, and plugins (typography, container-queries, animate) for the frontend.",
  "project_state.json": "Project state metadata for FaceAttend tracking existing features (admin registration page, routing, query hooks) and pending new feature requests around the admin registration flow."
}