{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Admin Registration Flow",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Create an Admin Registration page that allows authenticated users to self-register as admin via Internet Identity",
      "acceptanceCriteria": [
        "A dedicated Admin Registration page is accessible via hash route (e.g., #admin-register)",
        "The page shows a 'Register as Admin' button that is only enabled when the user is authenticated via Internet Identity",
        "On successful registration, the user is redirected to the admin dashboard or login page",
        "Error messages are displayed if registration fails (e.g., already registered)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminRegister.tsx",
          "operation": "create",
          "description": "Create the Admin Registration page component. Use the authorization component's guidance for authentication checks. Display a 'Register as Admin' button that calls the useRegisterAsAdmin mutation hook. Show loading state during registration. On success, navigate to #admin (AdminDashboard). Display error messages if registration fails (e.g., user already registered). Ensure the button is only enabled when the user is authenticated via Internet Identity. Use the useInternetIdentity hook to check authentication state. Follow the existing page patterns in AdminLogin.tsx and AdminDashboard.tsx for layout and styling consistency."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Wire the Admin Registration page into the app routing and add navigation from AdminLogin",
      "acceptanceCriteria": [
        "Navigating to #admin-register renders the AdminRegister page",
        "Existing routes (#admin, default) remain unaffected",
        "A link or button on the AdminLogin page navigates to the #admin-register route"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add the #admin-register hash route to the existing routing logic. Import AdminRegister from './pages/AdminRegister'. When window.location.hash is '#admin-register', render the AdminRegister page. Ensure the new route does not interfere with existing #admin and default routes. Place the new route check before the default student flow rendering."
        },
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Add a link or button that navigates to #admin-register. Place it below the main login button or in a 'Don't have admin access?' section. Use a simple anchor tag or button that sets window.location.hash to 'admin-register'. Style it consistently with the existing page design."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a TanStack Query mutation hook for admin registration backend calls",
      "acceptanceCriteria": [
        "A useRegisterAsAdmin mutation hook is exported from useQueries.ts",
        "The hook calls the backend registration function using the actor",
        "The hook returns loading, error, and success states consumable by the AdminRegister page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook named useRegisterAsAdmin following the existing mutation patterns in this file (similar to useSaveCallerUserProfile or useRegisterStudentProfile). The hook should call actor.registerAdminUser() when invoked. Use useMutation from @tanstack/react-query. Include error extraction using the existing extractError utility. Export the hook so it can be used in the AdminRegister page. The mutation should invalidate relevant queries (e.g., 'currentUserRole', 'isCallerAdmin') on success to refresh authorization state."
        }
      ]
    }
  ]
}